artillery.yml
config:
  target: "http://127.0.0.1:3000"
  phases:
    - duration: 60
      arrivalRate: 10
scenarios:
  - flow:
      - log: "New virtual user running"
      - get:
          url: "/video/sxlzyyNKPQiIdcvG"
      - post:
          url: "/signUp"
          json:
            user_email: "ab@asu.py"
            channel_name: "cool channel"

      - post:
          url: "/upload"
          json:
            channel_id: "~+h{!kk~6yr"
            category_id: "22"
            title: "Ohariuwi vi foh fajma adi kafmozmi needibah div za foku piszojma no heli johez korhibug."
            description: "Munapu leh zego ukitol olanonur behwo siv ohezugu mata nesco juzi batto bokcoveb ehuhekdef."
            tags: '["tik", "wilweh", "kelfileg", "egcogop"]'
            publishedAt: "2017-12-19T01:13:38.196Z"
            thumbnails: '{"default": {"url": "https://i.ytimg.com/vi/Ks-_Mh1QhMc/default.jpg", "width": 120, "height": 90}}'